---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
source: html/f2d7b928-5079-4e0f-403b-8f6aa6165926.htm
---
# StructuralSectionLProfile Members

Creates a new instance of Structural Section L Profile shape with the associated set of parameters,
 used to attach to structural element.